app/Controllers/Artikel.php

INSERT INTO `artikel` (`judul`, `isi`, `slug`, `gambar`) VALUES ('Artikel keempat', 'fskmllkkkkk', 'Artikel-keempat', 'download (1).jpeg')
---
    public function add()
    {
        // validasi data
        $validation     = \Config\Services::validation();
        $validation->setRules(['judul'=>'required']);
        $isDataValid    = $validation->withRequest($this->request)->run();

        if ($isDataValid)
        {
            $file = $this->request->getFile('gambar');
            $file->move(ROOTPATH .'public/gambar');

            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul'     => $this->request->getPost('judul'),
                'isi'       => $this->request->getPost('isi'),
                'slug'      => url_title($this->request->getPost('judul')),
                'gambar'    => $file->getName(),
            ]);